        IDENTIFICATION DIVISION.
        PROGRAM-ID. PANGRAM.
        ENVIRONMENT DIVISION.
        DATA DIVISION.
        WORKING-STORAGE SECTION.
      * 
       01 WS-SENTENCE               PIC X(60).
       01 WS-RESULT                 PIC 9.
       01 WS-LETTER-COUNT           PIC 99    VALUE 0.
       01 WS-SPECIFIC-LETTER-COUNT  PIC 99    VALUE 0.
       01 WS-LETTER-ITERATOR        PIC 99    VALUE 0. 
      *   
        PROCEDURE DIVISION.
      * 
       PANGRAM.
           MOVE FUNCTION LOWER-CASE(WS-SENTENCE) TO WS-SENTENCE.
           PERFORM CHECK-LETTER
              WITH TEST AFTER
              VARYING WS-LETTER-ITERATOR FROM 1 BY 1
              UNTIL WS-LETTER-ITERATOR >= 26.
           IF (WS-LETTER-COUNT >= 26)
              MOVE 1 TO WS-RESULT
           ELSE
              MOVE 0 TO WS-RESULT
           END-IF.
           EXIT.
      *
       CHECK-LETTER.
      *    MOVE ALPHABET-LETTER(ALPHABETIC-TABLE-INDEX) TO TEMP1.
      *    MOVE FUNCTION LOWER-CASE(TEMP1) TO TEMP2.
           INSPECT WS-SENTENCE TALLYING WS-SPECIFIC-LETTER-COUNT
              FOR ALL FUNCTION CHAR(98 + WS-LETTER-ITERATOR)
      *    INSPECT WS-SENTENCE TALLYING WS-SPECIFIC-L-LETTER-COUNT
      *       FOR ALL TEMP2.
           IF (WS-SPECIFIC-LETTER-COUNT > 0)
      *       OR WS-SPECIFIC-L-LETTER-COUNT > 0)
              ADD 1 TO WS-LETTER-COUNT
           END-IF.
      *